<a href="https://colab.research.google.com/github/Manas-P/forecasting_co2_emission_threshold/blob/main/Forecast_co2_threshold.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import numpy as np
import pandas as pd
import statsmodels.api as sm
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
url='https://raw.githubusercontent.com/Manas-P/forecasting_co2_emission_threshold/main/emission_dataset.csv'
df=pd.read_csv(url)

In [4]:
df.head()

      Date  Amount
0  2010-01     126
1  2010-02     124
2  2010-03     125
3  2010-04     126
4  2010-05     124

In [5]:
df.tail()

        Date  Amount
127  2020-08     213
128  2020-09     218
129  2020-10     217
130  2020-11     220
131  2020-12     219

In [6]:
df.columns=["Month","CO2 Amount (g/mile)"] #Change Title
df.head()

     Month  CO2 Amount (g/mile)
0  2010-01                  126
1  2010-02                  124
2  2010-03                  125
3  2010-04                  126
4  2010-05                  124

In [7]:
df['Month']=pd.to_datetime(df['Month']) #Converted Month into Datetime

In [9]:
df.head()

       Month  CO2 Amount (g/mile)
0 2010-01-01                  126
1 2010-02-01                  124
2 2010-03-01                  125
3 2010-04-01                  126
4 2010-05-01                  124

In [10]:
df.set_index('Month',inplace=True) #Set month column as index

In [11]:
df.head()

            CO2 Amount (g/mile)
Month
2010-01-01                  126
2010-02-01                  124
2010-03-01                  125
2010-04-01                  126
2010-05-01                  124

In [12]:
df.describe()

       CO2 Amount (g/mile)
count           132.000000
mean            178.606061
std              27.363194
min             124.000000
25%             163.000000
50%             188.500000
75%             198.250000
max             220.000000